---
kind: method
id: M:Autodesk.Revit.DB.NavisworksExportOptions.GetSelectedElementIds
source: html/071adb98-310b-3b6a-acc2-e98d9c94771f.htm
---
# Autodesk.Revit.DB.NavisworksExportOptions.GetSelectedElementIds Method

Returns the element ids of the elements to export. Empty by default.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetSelectedElementIds()
```